### Pandas
1. Series : 1차원 Vector + 명시적 index
2. DataFrame : 2차원 Matrix + 명시적 index

### Series

In [4]:
import numpy as np
import pandas as pd

In [5]:
L = [1,2,3,5]
pd.Series(L) # index를 명시하지 않으면 0부터 자동으로 index가 생성

0    1
1    2
2    3
3    5
dtype: int64

In [8]:
L = [1,2,3,5]
pd.Series(L, index = ['a','b','c','d']) # index를 지정하면 지저오딘 인덱스로 생성

a    1
b    2
c    3
d    5
dtype: int64

In [10]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
pd.Series(L) # 딕셔너리를 시리즈로 만들면 키가 인덱스가 됨

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
s = pd.Series(L, index = ['a', 'b','c','d','e','f','g']) # 인덱스 중심으로 만들어서 value 없어도 걍 만들어버림 ㅡ.ㅡ

In [16]:
s['c']

3.0

In [17]:
s['g'] = 100
s

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [18]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [19]:
s.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

### DataFrame

In [22]:
raw_data = {
    'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
    'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
    'age': [42,52,36,24,75],
    'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']
}
raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [24]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [25]:
pd.DataFrame(raw_data, columns = ['last_name', 'first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [26]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [31]:
# 컬럼 선택

In [27]:
df['first_name'] # 컬럼명 인뎅싱해서 컬럼선택

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [30]:
df[['age', 'city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [36]:
df.index = ['a', 'b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [37]:
df.loc['c']

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [38]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [39]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [40]:
# # df['칼럼명'] => 해당 칼럼을 출력

# # df.loc['인덱스명'] => 해당 행을 선택
# # df.iloc[row인덱스 번호] => 해당 행 선택

# df.loc['인덱스명', '칼럼명']
# df.iloc[인덱스번호, 칼럼번호]

In [41]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [43]:
df.loc[['b', 'c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [44]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [45]:
df.loc[['b', 'c'], ['last_name', 'age']]

  last_name  age
b  jacobson   52
c       ali   36

In [46]:
df.iloc[[1,2,3], [1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [47]:
df.iloc[1:4, 1:3]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [48]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [50]:
df.loc[:,'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [51]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [52]:
df.loc[['a', 'b'], ['last_name', 'age']]

  last_name  age
a    miller   42
b  jacobson   52

In [53]:
df.loc[['a', 'b'], ['first_name', 'age']]

  first_name  age
a      jason   42
b      molly   52

In [54]:
df.iloc[[0,1], [0,1]]

  first_name last_name
a      jason    miller
b      molly  jacobson

In [55]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [56]:
df.loc[['b','c'], ['last_name', 'age', 'city']]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [57]:
df.iloc[[1,2], [1,2,3]]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [59]:
df.iloc[[1,2], 1:3]

  last_name  age
b  jacobson   52
c       ali   36

In [60]:
df.loc[['b','c'], 'first_name':'age']

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36

In [61]:
df.loc[:, 'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [62]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [63]:
df['age']

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [64]:
df.age

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [65]:
df['age']>40

a     True
b     True
c    False
d    False
e     True
Name: age, dtype: bool

In [ ]:
df[df['age']>40]

In [66]:
df.loc[df['age']>40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

In [67]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [70]:
# 사는 곳이 마이애미인 사람 출력
df['city'] == 'miami'

a    False
b    False
c     True
d    False
e    False
Name: city, dtype: bool

In [69]:
df.loc[df['city'] == 'miami']

  first_name last_name  age   city
c       tina       ali   36  miami

In [71]:
# ali의 나이는?

In [72]:
df.last_name=='ali'

a    False
b    False
c     True
d    False
e    False
Name: last_name, dtype: bool

In [73]:
df[df.last_name=='ali']

  first_name last_name  age   city
c       tina       ali   36  miami

In [77]:
df[df.last_name=='ali'].age

c    36
Name: age, dtype: int64

In [78]:
df.T # transpose : 행과 열의 전환

                        a          b      c        d       e
first_name          jason      molly   tina     jake     any
last_name          miller   jacobson    ali   milner   cooze
age                    42         52     36       24      75
city        san francisco  baltimore  miami  douglas  boston

In [79]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [80]:
df.columns

Index(['first_name', 'last_name', 'age', 'city'], dtype='object')

In [81]:
df.to_csv('test_df.csv')

In [82]:
pwd

'D:\\Bigdata\\numpy'

In [84]:
!dir

 D 드라이브의 볼륨: 새 볼륨
 볼륨 일련 번호: 8A45-2B88

 D:\Bigdata\numpy 디렉터리

2020-10-20  오후 03:25    <DIR>          .
2020-10-20  오후 03:25    <DIR>          ..
2020-10-20  오후 12:37    <DIR>          .ipynb_checkpoints
2020-10-19  오후 06:52            27,989 20201019_01_Numpy.ipynb
2020-10-20  오후 12:25            19,794 20201020_01_Numpy_2.ipynb
2020-10-20  오후 03:24            64,790 20201020_02_pandas_1.ipynb
2020-10-20  오후 03:25               166 test_df.csv
2020-10-20  오후 12:14            11,802 Untitled.ipynb
               5개 파일             124,541 바이트
               3개 디렉터리  743,907,028,992 바이트 남음

In [86]:
df.head()

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [87]:
df.head(3)

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami

In [88]:
df.tail(2)

  first_name last_name  age     city
d       jake    milner   24  douglas
e        any     cooze   75   boston

In [89]:
del df['age']

In [90]:
df

  first_name last_name           city
a      jason    miller  san francisco
b      molly  jacobson      baltimore
c       tina       ali          miami
d       jake    milner        douglas
e        any     cooze         boston

In [92]:
df.drop('a')

  first_name last_name       city
b      molly  jacobson  baltimore
c       tina       ali      miami
d       jake    milner    douglas
e        any     cooze     boston

In [93]:
df.drop('city', axis=1) # 삭제 영역에서는 axis 방향이 바뀜

  first_name last_name
a      jason    miller
b      molly  jacobson
c       tina       ali
d       jake    milner
e        any     cooze

In [94]:
del df

In [95]:
df

NameError: name 'df' is not defined

In [97]:
df = pd.read_csv('test_df.csv')
df

  Unnamed: 0 first_name last_name  age           city
0          a      jason    miller   42  san francisco
1          b      molly  jacobson   52      baltimore
2          c       tina       ali   36          miami
3          d       jake    milner   24        douglas
4          e        any     cooze   75         boston

In [148]:
df = pd.read_csv('test_df.csv', index_col=0)
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [98]:
# apply

In [99]:
# age 칼럼의 값을 한국나이로 전환 => +1

In [104]:
kor_age = []
for a in df.age:
    kor_age.append(a+1)
kor_age

[44, 54, 38, 26, 77]

In [103]:
df

  Unnamed: 0 first_name last_name  age           city
0          a      jason    miller   43  san francisco
1          b      molly  jacobson   53      baltimore
2          c       tina       ali   37          miami
3          d       jake    milner   25        douglas
4          e        any     cooze   76         boston

In [105]:
def kor_age(a):
    return a+1

In [106]:
df['age'].apply(kor_age)

0    44
1    54
2    38
3    26
4    77
Name: age, dtype: int64

In [107]:
df['age'].apply(lambda x: x+1)

0    44
1    54
2    38
3    26
4    77
Name: age, dtype: int64

In [109]:
df['job'] = ['teacher', 'driver', 'doctor', 'cook', 'engineer']

In [110]:
df

  Unnamed: 0 first_name last_name  age           city       job
0          a      jason    miller   43  san francisco   teacher
1          b      molly  jacobson   53      baltimore    driver
2          c       tina       ali   37          miami    doctor
3          d       jake    milner   25        douglas      cook
4          e        any     cooze   76         boston  engineer

In [100]:
df['age']+1

0    43
1    53
2    37
3    25
4    76
Name: age, dtype: int64

In [102]:
df['age'] = df['age']+1

In [111]:
df['age'] = df['age'].apply(lambda x: x+1) # 위에거랑 이거랑 결과가 같음

In [114]:
wages = pd.read_csv('./wages.csv')
wages

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

In [115]:
wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [116]:
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [119]:
wages['height'] = wages['height'].apply(lambda x: int(x)) # 키값 정수화

In [120]:
wages

              earn  height     sex   race  ed  age
0     79571.299011      73    male  white  16   49
1     96396.988643      66  female  white  16   62
2     48710.666947      63  female  white  16   33
3     80478.096153      63  female  other  16   95
4     82089.345498      63  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363      71    male  white  12   33
1375  24853.519514      61  female  white  18   86
1376  13710.671312      63  female  white  12   37
1377  95426.014410      71    male  white  12   54
1378   9575.461857      68    male  white  12   31

[1379 rows x 6 columns]

### Groupby
1. 동일 종류의 데이터끼리 묶어서 처리
2. df['칼럼'].['칼럼']. 연산함수

In [122]:
wages.groupby('sex')['earn'].mean()

# groupby 이중구조
# 1. data grouping => wages.groupby('sex')
# 2. group별 값을 계산 => ['earn'].mean()

sex
female    24245.647877
male      45993.126922
Name: earn, dtype: float64

In [123]:
#인종별 평균 교육연수(ed)

In [124]:
wages.groupby('race')['ed'].mean()

race
black       13.039683
hispanic    12.987013
other       13.965517
white       13.398431
Name: ed, dtype: float64

In [126]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Giant', 'Kings', \
                'Kings', 'Riders', 'Royals','Royals', 'Riders'],
       'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
       'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
       'Points':[876,788,863,673,741,812,756,788,694,721,804,923]}
data

{'Team': ['Riders',
  'Riders',
  'Devils',
  'Devils',
  'Kings',
  'Giant',
  'Kings',
  'Kings',
  'Riders',
  'Royals',
  'Royals',
  'Riders'],
 'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
 'Year': [2014,
  2015,
  2014,
  2015,
  2014,
  2015,
  2016,
  2017,
  2016,
  2014,
  2015,
  2017],
 'Points': [876, 788, 863, 673, 741, 812, 756, 788, 694, 721, 804, 923]}

In [128]:
df = pd.DataFrame(data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     788
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [129]:
# 팀별 역대득점 총합

In [133]:
df.groupby('Team')['Points'].sum()

Team
Devils    1536
Giant      812
Kings     2285
Riders    3281
Royals    1525
Name: Points, dtype: int64

In [134]:
# 팀별 최고 순위

In [135]:
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [136]:
# 연도별 최고 득점

In [137]:
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    923
Name: Points, dtype: int64

##### grouped 객체

In [138]:
grouped = df.groupby('Team')

In [139]:
grouped.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [140]:
grouped.get_group('Royals')

      Team  Rank  Year  Points
9   Royals     4  2014     721
10  Royals     1  2015     804

In [141]:
grouped.min()

        Rank  Year  Points
Team
Devils     2  2014     673
Giant      4  2015     812
Kings      1  2014     741
Riders     1  2014     694
Royals     1  2014     721

In [142]:
grouped.mean()

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Giant   4.000000  2015.000000  812.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  820.250000
Royals  2.500000  2014.500000  762.500000

In [143]:
grouped['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    820.250000
Royals    762.500000
Name: Points, dtype: float64

In [146]:
grouped[['Rank','Points']].agg([np.sum, np.mean, np.std])

       Rank                     Points
        sum      mean       std    sum        mean         std
Team
Devils    5  2.500000  0.707107   1536  768.000000  134.350288
Giant     4  4.000000       NaN    812  812.000000         NaN
Kings     5  1.666667  1.154701   2285  761.666667   24.006943
Riders    7  1.750000  0.500000   3281  820.250000  101.068871
Royals    5  2.500000  2.121320   1525  762.500000   58.689863

In [147]:
# df.groupby('Team')['Points'].mean() 요거랑 아래거랑 같은거
grouped = df.groupby('Team')
grouped['Points'].agg(np.mean)

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    820.250000
Royals    762.500000
Name: Points, dtype: float64